/*題目內容:

编写一个模拟超市购物程序。购物时，如果购物者要购买的商品在超市中有，则提示“购物者买到了某商品”；如果没有所需的商品，则提示“购物者所需某商品无货”。该程序涉及商品、超市、购物者三个类，具体要求如下：
（1）商品类Product，包含商品名属性和set及get方法；
（2）超市类Market，包含超市名属性、存放商品的Product类型数组属性，set、get超市名的方法，能够获取商品或者存入商品的get、set方法，卖货的方法sell(String ProductName),该方法的功能是查找超市是否有所要购买的商品，如果有，则返回商品名；如果没有则返回空；
（3）购物者类Person，包含购物者姓名，set、get姓名的方法；购物的方法shopping，要求把超市名和商品名作为参数，调用Market类的sell方法返回购物结果；
（4）定义测试类Shopping，创建电视机、洗衣机、豆浆机、打印机等商品；创建超市，并将商品存入超市中；创建购物者对象，并进行购物；输入超市名和要购买的商品名，根据购物结果给出结论。

输入输出说明:

输入：家乐福 计算机
输出：张乐所需商品无货
输入：家家乐福 电视机
输出：张乐买到了电视机

*/
public class Main {

}
